Autodesk.Revit.DB.CancellationListener.IsCancelled
Returns true if the operation associated with this instance has been cancelled.
Since:
2017

Autodesk.Revit.DB.CancellationListener.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CancellationListener
Allows clients to poll the cancellation status of a background operation. Revit instantiates
CancellationListener objects for internal background operation implementations only. As such,
third-party developers are not expected to instantiate or handle CancellationListener objects.
Since:
2017